
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ОстаткиПродуктов Приход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаНоменклатураТЧ Из НоменклатураТЧ Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаНоменклатураТЧ.Номенклатура;
		Движение.Количество = ТекСтрокаНоменклатураТЧ.Количество;
		Движение.Сумма = ТекСтрокаНоменклатураТЧ.Сумма;
	КонецЦикла;

КонецПроцедуры
