#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЗаказыКлиентов Расход
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Для Каждого ТекСтрокаЗаказанныеИзделия Из ЗаказанныеИзделия Цикл
		Движение = Движения.ЗаказыКлиентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЗаказКлиента = ЗаказКлиента;
		Движение.Номенклатура = ТекСтрокаЗаказанныеИзделия.Изделие;
		Движение.Спецификация = ТекСтрокаЗаказанныеИзделия.Спецификация;
		Движение.Количество = ТекСтрокаЗаказанныеИзделия.Количество;
		Движение.Сумма = ТекСтрокаЗаказанныеИзделия.Сумма;
	КонецЦикла;

КонецПроцедуры
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли