#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ПроизводствоИзделий Приход
	Движения.ПроизводствоИзделий.Записывать = Истина;
	Движение = Движения.ПроизводствоИзделий.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Изделие = Изделие;
	Движение.Спецификация = Спецификация;
	Движение.ЗаказКлиента = ЗаказКлиента;
	Движение.Количество = Потребность;
КонецПроцедуры
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
