
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЗаказыКлиентов Приход
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Для Каждого ТекСтрокаЗаказанныеИзделия Из ЗаказанныеИзделия Цикл
		Движение = Движения.ЗаказыКлиентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗаказКлиента = Ссылка;
		Движение.Номенклатура = ТекСтрокаЗаказанныеИзделия.Изделие;
		Движение.Спецификация = ТекСтрокаЗаказанныеИзделия.Спецификация;
		Движение.Количество = ТекСтрокаЗаказанныеИзделия.Количество;
		Движение.Сумма = ТекСтрокаЗаказанныеИзделия.Сумма;
	КонецЦикла;

	// регистр ПроизводствоИзделий Приход
	//Движения.ПроизводствоИзделий.Записывать = Истина;
	//Для Каждого ТекСтрокаЗаказанныеИзделия Из ЗаказанныеИзделия Цикл
	//	Движение = Движения.ПроизводствоИзделий.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Изделие = ТекСтрокаЗаказанныеИзделия.Изделие;
	//	Движение.Спецификация = ТекСтрокаЗаказанныеИзделия.Спецификация;
	//	Движение.ЗаказКлиента = Ссылка;
	//	Движение.Количество = ТекСтрокаЗаказанныеИзделия.Количество;
	//КонецЦикла;

КонецПроцедуры
